espressif/esp-idf/components/soc/esp32c61/register/soc/apb_saradc_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** SARADC_CTRL_REG register
 *  digital saradc configure register
 */
#define SARADC_CTRL_REG (DR_REG_SARADC_BASE + 0x0)
/** SARADC_START_FORCE : R/W; bitpos: [0]; default: 0;
 *  select software enable saradc sample
 */
#define SARADC_START_FORCE    (BIT(0))
#define SARADC_START_FORCE_M  (SARADC_START_FORCE_V << SARADC_START_FORCE_S)
#define SARADC_START_FORCE_V  0x00000001U
#define SARADC_START_FORCE_S  0
/** SARADC_START : R/W; bitpos: [1]; default: 0;
 *  software enable saradc sample
 */
#define SARADC_START    (BIT(1))
#define SARADC_START_M  (SARADC_START_V << SARADC_START_S)
#define SARADC_START_V  0x00000001U
#define SARADC_START_S  1
/** SARADC_SAR_CLK_GATED : R/W; bitpos: [6]; default: 1;
 *  SAR clock gated
 */
#define SARADC_SAR_CLK_GATED    (BIT(6))
#define SARADC_SAR_CLK_GATED_M  (SARADC_SAR_CLK_GATED_V << SARADC_SAR_CLK_GATED_S)
#define SARADC_SAR_CLK_GATED_V  0x00000001U
#define SARADC_SAR_CLK_GATED_S  6
/** SARADC_SAR_CLK_DIV : R/W; bitpos: [14:7]; default: 4;
 *  SAR clock divider
 */
#define SARADC_SAR_CLK_DIV    0x000000FFU
#define SARADC_SAR_CLK_DIV_M  (SARADC_SAR_CLK_DIV_V << SARADC_SAR_CLK_DIV_S)
#define SARADC_SAR_CLK_DIV_V  0x000000FFU
#define SARADC_SAR_CLK_DIV_S  7
/** SARADC_SAR_PATT_LEN : R/W; bitpos: [17:15]; default: 7;
 *  0 ~ 15 means length 1 ~ 16
 */
#define SARADC_SAR_PATT_LEN    0x00000007U
#define SARADC_SAR_PATT_LEN_M  (SARADC_SAR_PATT_LEN_V << SARADC_SAR_PATT_LEN_S)
#define SARADC_SAR_PATT_LEN_V  0x00000007U
#define SARADC_SAR_PATT_LEN_S  15
/** SARADC_SAR_PATT_P_CLEAR : R/W; bitpos: [23]; default: 0;
 *  clear the pointer of pattern table for DIG ADC1 CTRL
 */
#define SARADC_SAR_PATT_P_CLEAR    (BIT(23))
#define SARADC_SAR_PATT_P_CLEAR_M  (SARADC_SAR_PATT_P_CLEAR_V << SARADC_SAR_PATT_P_CLEAR_S)
#define SARADC_SAR_PATT_P_CLEAR_V  0x00000001U
#define SARADC_SAR_PATT_P_CLEAR_S  23
/** SARADC_XPD_SAR_FORCE : R/W; bitpos: [28:27]; default: 0;
 *  force option to xpd sar blocks
 */
#define SARADC_XPD_SAR_FORCE    0x00000003U
#define SARADC_XPD_SAR_FORCE_M  (SARADC_XPD_SAR_FORCE_V << SARADC_XPD_SAR_FORCE_S)
#define SARADC_XPD_SAR_FORCE_V  0x00000003U
#define SARADC_XPD_SAR_FORCE_S  27
/** SARADC_SARADC2_PWDET_DRV : R/W; bitpos: [29]; default: 0;
 *  enable saradc2 power detect driven func.
 */
#define SARADC_SARADC2_PWDET_DRV    (BIT(29))
#define SARADC_SARADC2_PWDET_DRV_M  (SARADC_SARADC2_PWDET_DRV_V << SARADC_SARADC2_PWDET_DRV_S)
#define SARADC_SARADC2_PWDET_DRV_V  0x00000001U
#define SARADC_SARADC2_PWDET_DRV_S  29
/** SARADC_WAIT_ARB_CYCLE : R/W; bitpos: [31:30]; default: 1;
 *  wait arbit signal stable after sar_done
 */
#define SARADC_WAIT_ARB_CYCLE    0x00000003U
#define SARADC_WAIT_ARB_CYCLE_M  (SARADC_WAIT_ARB_CYCLE_V << SARADC_WAIT_ARB_CYCLE_S)
#define SARADC_WAIT_ARB_CYCLE_V  0x00000003U
#define SARADC_WAIT_ARB_CYCLE_S  30

/** SARADC_CTRL2_REG register
 *  digital saradc configure register
 */
#define SARADC_CTRL2_REG (DR_REG_SARADC_BASE + 0x4)
/** SARADC_MEAS_NUM_LIMIT : R/W; bitpos: [0]; default: 0;
 *  enable max meas num
 */
#define SARADC_MEAS_NUM_LIMIT    (BIT(0))
#define SARADC_MEAS_NUM_LIMIT_M  (SARADC_MEAS_NUM_LIMIT_V << SARADC_MEAS_NUM_LIMIT_S)
#define SARADC_MEAS_NUM_LIMIT_V  0x00000001U
#define SARADC_MEAS_NUM_LIMIT_S  0
/** SARADC_MAX_MEAS_NUM : R/W; bitpos: [8:1]; default: 255;
 *  max conversion number
 */
#define SARADC_MAX_MEAS_NUM    0x000000FFU
#define SARADC_MAX_MEAS_NUM_M  (SARADC_MAX_MEAS_NUM_V << SARADC_MAX_MEAS_NUM_S)
#define SARADC_MAX_MEAS_NUM_V  0x000000FFU
#define SARADC_MAX_MEAS_NUM_S  1
/** SARADC_SAR1_INV : R/W; bitpos: [9]; default: 0;
 *  1: data to DIG ADC1 CTRL is inverted, otherwise not
 */
#define SARADC_SAR1_INV    (BIT(9))
#define SARADC_SAR1_INV_M  (SARADC_SAR1_INV_V << SARADC_SAR1_INV_S)
#define SARADC_SAR1_INV_V  0x00000001U
#define SARADC_SAR1_INV_S  9
/** SARADC_SAR2_INV : R/W; bitpos: [10]; default: 0;
 *  1: data to DIG ADC2 CTRL is inverted, otherwise not
 */
#define SARADC_SAR2_INV    (BIT(10))
#define SARADC_SAR2_INV_M  (SARADC_SAR2_INV_V << SARADC_SAR2_INV_S)
#define SARADC_SAR2_INV_V  0x00000001U
#define SARADC_SAR2_INV_S  10
/** SARADC_TIMER_TARGET : R/W; bitpos: [23:12]; default: 10;
 *  to set saradc timer target
 */
#define SARADC_TIMER_TARGET    0x00000FFFU
#define SARADC_TIMER_TARGET_M  (SARADC_TIMER_TARGET_V << SARADC_TIMER_TARGET_S)
#define SARADC_TIMER_TARGET_V  0x00000FFFU
#define SARADC_TIMER_TARGET_S  12
/** SARADC_TIMER_EN : R/W; bitpos: [24]; default: 0;
 *  to enable saradc timer trigger
 */
#define SARADC_TIMER_EN    (BIT(24))
#define SARADC_TIMER_EN_M  (SARADC_TIMER_EN_V << SARADC_TIMER_EN_S)
#define SARADC_TIMER_EN_V  0x00000001U
#define SARADC_TIMER_EN_S  24

/** SARADC_FILTER_CTRL1_REG register
 *  digital saradc configure register
 */
#define SARADC_FILTER_CTRL1_REG (DR_REG_SARADC_BASE + 0x8)
/** SARADC_FILTER_FACTOR1 : R/W; bitpos: [28:26]; default: 0;
 *  Factor of saradc filter1
 */
#define SARADC_FILTER_FACTOR1    0x00000007U
#define SARADC_FILTER_FACTOR1_M  (SARADC_FILTER_FACTOR1_V << SARADC_FILTER_FACTOR1_S)
#define SARADC_FILTER_FACTOR1_V  0x00000007U
#define SARADC_FILTER_FACTOR1_S  26
/** SARADC_FILTER_FACTOR0 : R/W; bitpos: [31:29]; default: 0;
 *  Factor of saradc filter0
 */
#define SARADC_FILTER_FACTOR0    0x00000007U
#define SARADC_FILTER_FACTOR0_M  (SARADC_FILTER_FACTOR0_V << SARADC_FILTER_FACTOR0_S)
#define SARADC_FILTER_FACTOR0_V  0x00000007U
#define SARADC_FILTER_FACTOR0_S  29

/** SARADC_FSM_WAIT_REG register
 *  digital saradc configure register
 */
#define SARADC_FSM_WAIT_REG (DR_REG_SARADC_BASE + 0xc)
/** SARADC_XPD_WAIT : R/W; bitpos: [7:0]; default: 8;
 *  saradc_xpd_wait
 */
#define SARADC_XPD_WAIT    0x000000FFU
#define SARADC_XPD_WAIT_M  (SARADC_XPD_WAIT_V << SARADC_XPD_WAIT_S)
#define SARADC_XPD_WAIT_V  0x000000FFU
#define SARADC_XPD_WAIT_S  0
/** SARADC_RSTB_WAIT : R/W; bitpos: [15:8]; default: 8;
 *  saradc_rstb_wait
 */
#define SARADC_RSTB_WAIT    0x000000FFU
#define SARADC_RSTB_WAIT_M  (SARADC_RSTB_WAIT_V << SARADC_RSTB_WAIT_S)
#define SARADC_RSTB_WAIT_V  0x000000FFU
#define SARADC_RSTB_WAIT_S  8
/** SARADC_STANDBY_WAIT : R/W; bitpos: [23:16]; default: 255;
 *  saradc_standby_wait
 */
#define SARADC_STANDBY_WAIT    0x000000FFU
#define SARADC_STANDBY_WAIT_M  (SARADC_STANDBY_WAIT_V << SARADC_STANDBY_WAIT_S)
#define SARADC_STANDBY_WAIT_V  0x000000FFU
#define SARADC_STANDBY_WAIT_S  16

/** SARADC_SAR1_STATUS_REG register
 *  digital saradc configure register
 */
#define SARADC_SAR1_STATUS_REG (DR_REG_SARADC_BASE + 0x10)
/** SARADC_SAR1_STATUS : RO; bitpos: [31:0]; default: 536870912;
 *  saradc1 status about data and channel
 */
#define SARADC_SAR1_STATUS    0xFFFFFFFFU
#define SARADC_SAR1_STATUS_M  (SARADC_SAR1_STATUS_V << SARADC_SAR1_STATUS_S)
#define SARADC_SAR1_STATUS_V  0xFFFFFFFFU
#define SARADC_SAR1_STATUS_S  0

/** SARADC_SAR2_STATUS_REG register
 *  digital saradc configure register
 */
#define SARADC_SAR2_STATUS_REG (DR_REG_SARADC_BASE + 0x14)
/** SARADC_SAR2_STATUS : RO; bitpos: [31:0]; default: 536870912;
 *  saradc2 status about data and channel
 */
#define SARADC_SAR2_STATUS    0xFFFFFFFFU
#define SARADC_SAR2_STATUS_M  (SARADC_SAR2_STATUS_V << SARADC_SAR2_STATUS_S)
#define SARADC_SAR2_STATUS_V  0xFFFFFFFFU
#define SARADC_SAR2_STATUS_S  0

/** SARADC_SAR_PATT_TAB1_REG register
 *  digital saradc configure register
 */
#define SARADC_SAR_PATT_TAB1_REG (DR_REG_SARADC_BASE + 0x18)
/** SARADC_SAR_PATT_TAB1 : R/W; bitpos: [23:0]; default: 16777215;
 *  item 0 ~ 3 for pattern table 1 (each item one byte)
 */
#define SARADC_SAR_PATT_TAB1    0x00FFFFFFU
#define SARADC_SAR_PATT_TAB1_M  (SARADC_SAR_PATT_TAB1_V << SARADC_SAR_PATT_TAB1_S)
#define SARADC_SAR_PATT_TAB1_V  0x00FFFFFFU
#define SARADC_SAR_PATT_TAB1_S  0

/** SARADC_SAR_PATT_TAB2_REG register
 *  digital saradc configure register
 */
#define SARADC_SAR_PATT_TAB2_REG (DR_REG_SARADC_BASE + 0x1c)
/** SARADC_SAR_PATT_TAB2 : R/W; bitpos: [23:0]; default: 16777215;
 *  Item 4 ~ 7 for pattern table 1 (each item one byte)
 */
#define SARADC_SAR_PATT_TAB2    0x00FFFFFFU
#define SARADC_SAR_PATT_TAB2_M  (SARADC_SAR_PATT_TAB2_V << SARADC_SAR_PATT_TAB2_S)
#define SARADC_SAR_PATT_TAB2_V  0x00FFFFFFU
#define SARADC_SAR_PATT_TAB2_S  0

/** SARADC_ONETIME_SAMPLE_REG register
 *  digital saradc configure register
 */
#define SARADC_ONETIME_SAMPLE_REG (DR_REG_SARADC_BASE + 0x20)
/** SARADC_ONETIME_ATTEN : R/W; bitpos: [24:23]; default: 0;
 *  configure onetime atten
 */
#define SARADC_ONETIME_ATTEN    0x00000003U
#define SARADC_ONETIME_ATTEN_M  (SARADC_ONETIME_ATTEN_V << SARADC_ONETIME_ATTEN_S)
#define SARADC_ONETIME_ATTEN_V  0x00000003U
#define SARADC_ONETIME_ATTEN_S  23
/** SARADC_ONETIME_CHANNEL : R/W; bitpos: [28:25]; default: 13;
 *  configure onetime channel
 */
#define SARADC_ONETIME_CHANNEL    0x0000000FU
#define SARADC_ONETIME_CHANNEL_M  (SARADC_ONETIME_CHANNEL_V << SARADC_ONETIME_CHANNEL_S)
#define SARADC_ONETIME_CHANNEL_V  0x0000000FU
#define SARADC_ONETIME_CHANNEL_S  25
/** SARADC_ONETIME_START : R/W; bitpos: [29]; default: 0;
 *  trigger adc onetime sample
 */
#define SARADC_ONETIME_START    (BIT(29))
#define SARADC_ONETIME_START_M  (SARADC_ONETIME_START_V << SARADC_ONETIME_START_S)
#define SARADC_ONETIME_START_V  0x00000001U
#define SARADC_ONETIME_START_S  29
/** SARADC_SARADC2_ONETIME_SAMPLE : R/W; bitpos: [30]; default: 0;
 *  enable adc2 onetime sample
 */
#define SARADC_SARADC2_ONETIME_SAMPLE    (BIT(30))
#define SARADC_SARADC2_ONETIME_SAMPLE_M  (SARADC_SARADC2_ONETIME_SAMPLE_V << SARADC_SARADC2_ONETIME_SAMPLE_S)
#define SARADC_SARADC2_ONETIME_SAMPLE_V  0x00000001U
#define SARADC_SARADC2_ONETIME_SAMPLE_S  30
/** SARADC_SARADC1_ONETIME_SAMPLE : R/W; bitpos: [31]; default: 0;
 *  enable adc1 onetime sample
 */
#define SARADC_SARADC1_ONETIME_SAMPLE    (BIT(31))
#define SARADC_SARADC1_ONETIME_SAMPLE_M  (SARADC_SARADC1_ONETIME_SAMPLE_V << SARADC_SARADC1_ONETIME_SAMPLE_S)
#define SARADC_SARADC1_ONETIME_SAMPLE_V  0x00000001U
#define SARADC_SARADC1_ONETIME_SAMPLE_S  31

/** SARADC_ARB_CTRL_REG register
 *  digital saradc configure register
 */
#define SARADC_ARB_CTRL_REG (DR_REG_SARADC_BASE + 0x24)
/** SARADC_ADC_ARB_APB_FORCE : R/W; bitpos: [2]; default: 0;
 *  adc2 arbiter force to enableapb controller
 */
#define SARADC_ADC_ARB_APB_FORCE    (BIT(2))
#define SARADC_ADC_ARB_APB_FORCE_M  (SARADC_ADC_ARB_APB_FORCE_V << SARADC_ADC_ARB_APB_FORCE_S)
#define SARADC_ADC_ARB_APB_FORCE_V  0x00000001U
#define SARADC_ADC_ARB_APB_FORCE_S  2
/** SARADC_ADC_ARB_RTC_FORCE : R/W; bitpos: [3]; default: 0;
 *  adc2 arbiter force to enable rtc controller
 */
#define SARADC_ADC_ARB_RTC_FORCE    (BIT(3))
#define SARADC_ADC_ARB_RTC_FORCE_M  (SARADC_ADC_ARB_RTC_FORCE_V << SARADC_ADC_ARB_RTC_FORCE_S)
#define SARADC_ADC_ARB_RTC_FORCE_V  0x00000001U
#define SARADC_ADC_ARB_RTC_FORCE_S  3
/** SARADC_ADC_ARB_WIFI_FORCE : R/W; bitpos: [4]; default: 0;
 *  adc2 arbiter force to enable wifi controller
 */
#define SARADC_ADC_ARB_WIFI_FORCE    (BIT(4))
#define SARADC_ADC_ARB_WIFI_FORCE_M  (SARADC_ADC_ARB_WIFI_FORCE_V << SARADC_ADC_ARB_WIFI_FORCE_S)
#define SARADC_ADC_ARB_WIFI_FORCE_V  0x00000001U
#define SARADC_ADC_ARB_WIFI_FORCE_S  4
/** SARADC_ADC_ARB_GRANT_FORCE : R/W; bitpos: [5]; default: 0;
 *  adc2 arbiter force grant
 */
#define SARADC_ADC_ARB_GRANT_FORCE    (BIT(5))
#define SARADC_ADC_ARB_GRANT_FORCE_M  (SARADC_ADC_ARB_GRANT_FORCE_V << SARADC_ADC_ARB_GRANT_FORCE_S)
#define SARADC_ADC_ARB_GRANT_FORCE_V  0x00000001U
#define SARADC_ADC_ARB_GRANT_FORCE_S  5
/** SARADC_ADC_ARB_APB_PRIORITY : R/W; bitpos: [7:6]; default: 0;
 *  Set adc2 arbiterapb priority
 */
#define SARADC_ADC_ARB_APB_PRIORITY    0x00000003U
#define SARADC_ADC_ARB_APB_PRIORITY_M  (SARADC_ADC_ARB_APB_PRIORITY_V << SARADC_ADC_ARB_APB_PRIORITY_S)
#define SARADC_ADC_ARB_APB_PRIORITY_V  0x00000003U
#define SARADC_ADC_ARB_APB_PRIORITY_S  6
/** SARADC_ADC_ARB_RTC_PRIORITY : R/W; bitpos: [9:8]; default: 1;
 *  Set adc2 arbiter rtc priority
 */
#define SARADC_ADC_ARB_RTC_PRIORITY    0x00000003U
#define SARADC_ADC_ARB_RTC_PRIORITY_M  (SARADC_ADC_ARB_RTC_PRIORITY_V << SARADC_ADC_ARB_RTC_PRIORITY_S)
#define SARADC_ADC_ARB_RTC_PRIORITY_V  0x00000003U
#define SARADC_ADC_ARB_RTC_PRIORITY_S  8
/** SARADC_ADC_ARB_WIFI_PRIORITY : R/W; bitpos: [11:10]; default: 2;
 *  Set adc2 arbiter wifi priority
 */
#define SARADC_ADC_ARB_WIFI_PRIORITY    0x00000003U
#define SARADC_ADC_ARB_WIFI_PRIORITY_M  (SARADC_ADC_ARB_WIFI_PRIORITY_V << SARADC_ADC_ARB_WIFI_PRIORITY_S)
#define SARADC_ADC_ARB_WIFI_PRIORITY_V  0x00000003U
#define SARADC_ADC_ARB_WIFI_PRIORITY_S  10
/** SARADC_ADC_ARB_FIX_PRIORITY : R/W; bitpos: [12]; default: 0;
 *  adc2 arbiter uses fixed priority
 */
#define SARADC_ADC_ARB_FIX_PRIORITY    (BIT(12))
#define SARADC_ADC_ARB_FIX_PRIORITY_M  (SARADC_ADC_ARB_FIX_PRIORITY_V << SARADC_ADC_ARB_FIX_PRIORITY_S)
#define SARADC_ADC_ARB_FIX_PRIORITY_V  0x00000001U
#define SARADC_ADC_ARB_FIX_PRIORITY_S  12

/** SARADC_FILTER_CTRL0_REG register
 *  digital saradc configure register
 */
#define SARADC_FILTER_CTRL0_REG (DR_REG_SARADC_BASE + 0x28)
/** SARADC_FILTER_CHANNEL1 : R/W; bitpos: [21:18]; default: 13;
 *  configure filter1 to adc channel
 */
#define SARADC_FILTER_CHANNEL1    0x0000000FU
#define SARADC_FILTER_CHANNEL1_M  (SARADC_FILTER_CHANNEL1_V << SARADC_FILTER_CHANNEL1_S)
#define SARADC_FILTER_CHANNEL1_V  0x0000000FU
#define SARADC_FILTER_CHANNEL1_S  18
/** SARADC_FILTER_CHANNEL0 : R/W; bitpos: [25:22]; default: 13;
 *  configure filter0 to adc channel
 */
#define SARADC_FILTER_CHANNEL0    0x0000000FU
#define SARADC_FILTER_CHANNEL0_M  (SARADC_FILTER_CHANNEL0_V << SARADC_FILTER_CHANNEL0_S)
#define SARADC_FILTER_CHANNEL0_V  0x0000000FU
#define SARADC_FILTER_CHANNEL0_S  22
/** SARADC_FILTER_RESET : R/W; bitpos: [31]; default: 0;
 *  enable apb_adc1_filter
 */
#define SARADC_FILTER_RESET    (BIT(31))
#define SARADC_FILTER_RESET_M  (SARADC_FILTER_RESET_V << SARADC_FILTER_RESET_S)
#define SARADC_FILTER_RESET_V  0x00000001U
#define SARADC_FILTER_RESET_S  31

/** SARADC_SAR1DATA_STATUS_REG register
 *  digital saradc configure register
 */
#define SARADC_SAR1DATA_STATUS_REG (DR_REG_SARADC_BASE + 0x2c)
/** SARADC_APB_SARADC1_DATA : RO; bitpos: [16:0]; default: 0;
 *  saradc1 data
 */
#define SARADC_APB_SARADC1_DATA    0x0001FFFFU
#define SARADC_APB_SARADC1_DATA_M  (SARADC_APB_SARADC1_DATA_V << SARADC_APB_SARADC1_DATA_S)
#define SARADC_APB_SARADC1_DATA_V  0x0001FFFFU
#define SARADC_APB_SARADC1_DATA_S  0

/** SARADC_SAR2DATA_STATUS_REG register
 *  digital saradc configure register
 */
#define SARADC_SAR2DATA_STATUS_REG (DR_REG_SARADC_BASE + 0x30)
/** SARADC_APB_SARADC2_DATA : RO; bitpos: [16:0]; default: 0;
 *  saradc2 data
 */
#define SARADC_APB_SARADC2_DATA    0x0001FFFFU
#define SARADC_APB_SARADC2_DATA_M  (SARADC_APB_SARADC2_DATA_V << SARADC_APB_SARADC2_DATA_S)
#define SARADC_APB_SARADC2_DATA_V  0x0001FFFFU
#define SARADC_APB_SARADC2_DATA_S  0

/** SARADC_THRES0_CTRL_REG register
 *  digital saradc configure register
 */
#define SARADC_THRES0_CTRL_REG (DR_REG_SARADC_BASE + 0x34)
/** SARADC_THRES0_CHANNEL : R/W; bitpos: [3:0]; default: 13;
 *  configure thres0 to adc channel
 */
#define SARADC_THRES0_CHANNEL    0x0000000FU
#define SARADC_THRES0_CHANNEL_M  (SARADC_THRES0_CHANNEL_V << SARADC_THRES0_CHANNEL_S)
#define SARADC_THRES0_CHANNEL_V  0x0000000FU
#define SARADC_THRES0_CHANNEL_S  0
/** SARADC_THRES0_HIGH : R/W; bitpos: [17:5]; default: 8191;
 *  saradc thres0 monitor thres
 */
#define SARADC_THRES0_HIGH    0x00001FFFU
#define SARADC_THRES0_HIGH_M  (SARADC_THRES0_HIGH_V << SARADC_THRES0_HIGH_S)
#define SARADC_THRES0_HIGH_V  0x00001FFFU
#define SARADC_THRES0_HIGH_S  5
/** SARADC_THRES0_LOW : R/W; bitpos: [30:18]; default: 0;
 *  saradc thres0 monitor thres
 */
#define SARADC_THRES0_LOW    0x00001FFFU
#define SARADC_THRES0_LOW_M  (SARADC_THRES0_LOW_V << SARADC_THRES0_LOW_S)
#define SARADC_THRES0_LOW_V  0x00001FFFU
#define SARADC_THRES0_LOW_S  18

/** SARADC_THRES1_CTRL_REG register
 *  digital saradc configure register
 */
#define SARADC_THRES1_CTRL_REG (DR_REG_SARADC_BASE + 0x38)
/** SARADC_THRES1_CHANNEL : R/W; bitpos: [3:0]; default: 13;
 *  configure thres1 to adc channel
 */
#define SARADC_THRES1_CHANNEL    0x0000000FU
#define SARADC_THRES1_CHANNEL_M  (SARADC_THRES1_CHANNEL_V << SARADC_THRES1_CHANNEL_S)
#define SARADC_THRES1_CHANNEL_V  0x0000000FU
#define SARADC_THRES1_CHANNEL_S  0
/** SARADC_THRES1_HIGH : R/W; bitpos: [17:5]; default: 8191;
 *  saradc thres1 monitor thres
 */
#define SARADC_THRES1_HIGH    0x00001FFFU
#define SARADC_THRES1_HIGH_M  (SARADC_THRES1_HIGH_V << SARADC_THRES1_HIGH_S)
#define SARADC_THRES1_HIGH_V  0x00001FFFU
#define SARADC_THRES1_HIGH_S  5
/** SARADC_THRES1_LOW : R/W; bitpos: [30:18]; default: 0;
 *  saradc thres1 monitor thres
 */
#define SARADC_THRES1_LOW    0x00001FFFU
#define SARADC_THRES1_LOW_M  (SARADC_THRES1_LOW_V << SARADC_THRES1_LOW_S)
#define SARADC_THRES1_LOW_V  0x00001FFFU
#define SARADC_THRES1_LOW_S  18

