espressif/esp-idf/components/soc/esp32c61/register/soc/apb_saradc_reg.h
/** SARADC_THRES_CTRL_REG register
 *  digital saradc configure register
 */
#define SARADC_THRES_CTRL_REG (DR_REG_SARADC_BASE + 0x3c)
/** SARADC_THRES_ALL_EN : R/W; bitpos: [27]; default: 0;
 *  enable thres to all channel
 */
#define SARADC_THRES_ALL_EN    (BIT(27))
#define SARADC_THRES_ALL_EN_M  (SARADC_THRES_ALL_EN_V << SARADC_THRES_ALL_EN_S)
#define SARADC_THRES_ALL_EN_V  0x00000001U
#define SARADC_THRES_ALL_EN_S  27
/** SARADC_THRES1_EN : R/W; bitpos: [30]; default: 0;
 *  enable thres1
 */
#define SARADC_THRES1_EN    (BIT(30))
#define SARADC_THRES1_EN_M  (SARADC_THRES1_EN_V << SARADC_THRES1_EN_S)
#define SARADC_THRES1_EN_V  0x00000001U
#define SARADC_THRES1_EN_S  30
/** SARADC_THRES0_EN : R/W; bitpos: [31]; default: 0;
 *  enable thres0
 */
#define SARADC_THRES0_EN    (BIT(31))
#define SARADC_THRES0_EN_M  (SARADC_THRES0_EN_V << SARADC_THRES0_EN_S)
#define SARADC_THRES0_EN_V  0x00000001U
#define SARADC_THRES0_EN_S  31

/** SARADC_INT_ENA_REG register
 *  digital saradc int register
 */
#define SARADC_INT_ENA_REG (DR_REG_SARADC_BASE + 0x40)
/** SARADC_TSENS_INT_ENA : R/W; bitpos: [25]; default: 0;
 *  tsens low  interrupt enable
 */
#define SARADC_TSENS_INT_ENA    (BIT(25))
#define SARADC_TSENS_INT_ENA_M  (SARADC_TSENS_INT_ENA_V << SARADC_TSENS_INT_ENA_S)
#define SARADC_TSENS_INT_ENA_V  0x00000001U
#define SARADC_TSENS_INT_ENA_S  25
/** SARADC_THRES1_LOW_INT_ENA : R/W; bitpos: [26]; default: 0;
 *  saradc thres1 low  interrupt enable
 */
#define SARADC_THRES1_LOW_INT_ENA    (BIT(26))
#define SARADC_THRES1_LOW_INT_ENA_M  (SARADC_THRES1_LOW_INT_ENA_V << SARADC_THRES1_LOW_INT_ENA_S)
#define SARADC_THRES1_LOW_INT_ENA_V  0x00000001U
#define SARADC_THRES1_LOW_INT_ENA_S  26
/** SARADC_THRES0_LOW_INT_ENA : R/W; bitpos: [27]; default: 0;
 *  saradc thres0 low interrupt enable
 */
#define SARADC_THRES0_LOW_INT_ENA    (BIT(27))
#define SARADC_THRES0_LOW_INT_ENA_M  (SARADC_THRES0_LOW_INT_ENA_V << SARADC_THRES0_LOW_INT_ENA_S)
#define SARADC_THRES0_LOW_INT_ENA_V  0x00000001U
#define SARADC_THRES0_LOW_INT_ENA_S  27
/** SARADC_THRES1_HIGH_INT_ENA : R/W; bitpos: [28]; default: 0;
 *  saradc thres1 high interrupt enable
 */
#define SARADC_THRES1_HIGH_INT_ENA    (BIT(28))
#define SARADC_THRES1_HIGH_INT_ENA_M  (SARADC_THRES1_HIGH_INT_ENA_V << SARADC_THRES1_HIGH_INT_ENA_S)
#define SARADC_THRES1_HIGH_INT_ENA_V  0x00000001U
#define SARADC_THRES1_HIGH_INT_ENA_S  28
/** SARADC_THRES0_HIGH_INT_ENA : R/W; bitpos: [29]; default: 0;
 *  saradc thres0 high interrupt enable
 */
#define SARADC_THRES0_HIGH_INT_ENA    (BIT(29))
#define SARADC_THRES0_HIGH_INT_ENA_M  (SARADC_THRES0_HIGH_INT_ENA_V << SARADC_THRES0_HIGH_INT_ENA_S)
#define SARADC_THRES0_HIGH_INT_ENA_V  0x00000001U
#define SARADC_THRES0_HIGH_INT_ENA_S  29
/** SARADC_APB_SARADC2_DONE_INT_ENA : R/W; bitpos: [30]; default: 0;
 *  saradc2 done interrupt enable
 */
#define SARADC_APB_SARADC2_DONE_INT_ENA    (BIT(30))
#define SARADC_APB_SARADC2_DONE_INT_ENA_M  (SARADC_APB_SARADC2_DONE_INT_ENA_V << SARADC_APB_SARADC2_DONE_INT_ENA_S)
#define SARADC_APB_SARADC2_DONE_INT_ENA_V  0x00000001U
#define SARADC_APB_SARADC2_DONE_INT_ENA_S  30
/** SARADC_APB_SARADC1_DONE_INT_ENA : R/W; bitpos: [31]; default: 0;
 *  saradc1 done interrupt enable
 */
#define SARADC_APB_SARADC1_DONE_INT_ENA    (BIT(31))
#define SARADC_APB_SARADC1_DONE_INT_ENA_M  (SARADC_APB_SARADC1_DONE_INT_ENA_V << SARADC_APB_SARADC1_DONE_INT_ENA_S)
#define SARADC_APB_SARADC1_DONE_INT_ENA_V  0x00000001U
#define SARADC_APB_SARADC1_DONE_INT_ENA_S  31

/** SARADC_INT_RAW_REG register
 *  digital saradc int register
 */
#define SARADC_INT_RAW_REG (DR_REG_SARADC_BASE + 0x44)
/** SARADC_TSENS_INT_RAW : R/WTC/SS; bitpos: [25]; default: 0;
 *  saradc tsens  interrupt raw
 */
#define SARADC_TSENS_INT_RAW    (BIT(25))
#define SARADC_TSENS_INT_RAW_M  (SARADC_TSENS_INT_RAW_V << SARADC_TSENS_INT_RAW_S)
#define SARADC_TSENS_INT_RAW_V  0x00000001U
#define SARADC_TSENS_INT_RAW_S  25
/** SARADC_THRES1_LOW_INT_RAW : R/WTC/SS; bitpos: [26]; default: 0;
 *  saradc thres1 low  interrupt raw
 */
#define SARADC_THRES1_LOW_INT_RAW    (BIT(26))
#define SARADC_THRES1_LOW_INT_RAW_M  (SARADC_THRES1_LOW_INT_RAW_V << SARADC_THRES1_LOW_INT_RAW_S)
#define SARADC_THRES1_LOW_INT_RAW_V  0x00000001U
#define SARADC_THRES1_LOW_INT_RAW_S  26
/** SARADC_THRES0_LOW_INT_RAW : R/WTC/SS; bitpos: [27]; default: 0;
 *  saradc thres0 low interrupt raw
 */
#define SARADC_THRES0_LOW_INT_RAW    (BIT(27))
#define SARADC_THRES0_LOW_INT_RAW_M  (SARADC_THRES0_LOW_INT_RAW_V << SARADC_THRES0_LOW_INT_RAW_S)
#define SARADC_THRES0_LOW_INT_RAW_V  0x00000001U
#define SARADC_THRES0_LOW_INT_RAW_S  27
/** SARADC_THRES1_HIGH_INT_RAW : R/WTC/SS; bitpos: [28]; default: 0;
 *  saradc thres1 high interrupt raw
 */
#define SARADC_THRES1_HIGH_INT_RAW    (BIT(28))
#define SARADC_THRES1_HIGH_INT_RAW_M  (SARADC_THRES1_HIGH_INT_RAW_V << SARADC_THRES1_HIGH_INT_RAW_S)
#define SARADC_THRES1_HIGH_INT_RAW_V  0x00000001U
#define SARADC_THRES1_HIGH_INT_RAW_S  28
/** SARADC_THRES0_HIGH_INT_RAW : R/WTC/SS; bitpos: [29]; default: 0;
 *  saradc thres0 high interrupt raw
 */
#define SARADC_THRES0_HIGH_INT_RAW    (BIT(29))
#define SARADC_THRES0_HIGH_INT_RAW_M  (SARADC_THRES0_HIGH_INT_RAW_V << SARADC_THRES0_HIGH_INT_RAW_S)
#define SARADC_THRES0_HIGH_INT_RAW_V  0x00000001U
#define SARADC_THRES0_HIGH_INT_RAW_S  29
/** SARADC_APB_SARADC2_DONE_INT_RAW : R/WTC/SS; bitpos: [30]; default: 0;
 *  saradc2 done interrupt raw
 */
#define SARADC_APB_SARADC2_DONE_INT_RAW    (BIT(30))
#define SARADC_APB_SARADC2_DONE_INT_RAW_M  (SARADC_APB_SARADC2_DONE_INT_RAW_V << SARADC_APB_SARADC2_DONE_INT_RAW_S)
#define SARADC_APB_SARADC2_DONE_INT_RAW_V  0x00000001U
#define SARADC_APB_SARADC2_DONE_INT_RAW_S  30
/** SARADC_APB_SARADC1_DONE_INT_RAW : R/WTC/SS; bitpos: [31]; default: 0;
 *  saradc1 done interrupt raw
 */
#define SARADC_APB_SARADC1_DONE_INT_RAW    (BIT(31))
#define SARADC_APB_SARADC1_DONE_INT_RAW_M  (SARADC_APB_SARADC1_DONE_INT_RAW_V << SARADC_APB_SARADC1_DONE_INT_RAW_S)
#define SARADC_APB_SARADC1_DONE_INT_RAW_V  0x00000001U
#define SARADC_APB_SARADC1_DONE_INT_RAW_S  31

/** SARADC_INT_ST_REG register
 *  digital saradc int register
 */
#define SARADC_INT_ST_REG (DR_REG_SARADC_BASE + 0x48)
/** SARADC_TSENS_INT_ST : RO; bitpos: [25]; default: 0;
 *  saradc tsens  interrupt state
 */
#define SARADC_TSENS_INT_ST    (BIT(25))
#define SARADC_TSENS_INT_ST_M  (SARADC_TSENS_INT_ST_V << SARADC_TSENS_INT_ST_S)
#define SARADC_TSENS_INT_ST_V  0x00000001U
#define SARADC_TSENS_INT_ST_S  25
/** SARADC_THRES1_LOW_INT_ST : RO; bitpos: [26]; default: 0;
 *  saradc thres1 low  interrupt state
 */
#define SARADC_THRES1_LOW_INT_ST    (BIT(26))
#define SARADC_THRES1_LOW_INT_ST_M  (SARADC_THRES1_LOW_INT_ST_V << SARADC_THRES1_LOW_INT_ST_S)
#define SARADC_THRES1_LOW_INT_ST_V  0x00000001U
#define SARADC_THRES1_LOW_INT_ST_S  26
/** SARADC_THRES0_LOW_INT_ST : RO; bitpos: [27]; default: 0;
 *  saradc thres0 low interrupt state
 */
#define SARADC_THRES0_LOW_INT_ST    (BIT(27))
#define SARADC_THRES0_LOW_INT_ST_M  (SARADC_THRES0_LOW_INT_ST_V << SARADC_THRES0_LOW_INT_ST_S)
#define SARADC_THRES0_LOW_INT_ST_V  0x00000001U
#define SARADC_THRES0_LOW_INT_ST_S  27
/** SARADC_THRES1_HIGH_INT_ST : RO; bitpos: [28]; default: 0;
 *  saradc thres1 high interrupt state
 */
#define SARADC_THRES1_HIGH_INT_ST    (BIT(28))
#define SARADC_THRES1_HIGH_INT_ST_M  (SARADC_THRES1_HIGH_INT_ST_V << SARADC_THRES1_HIGH_INT_ST_S)
#define SARADC_THRES1_HIGH_INT_ST_V  0x00000001U
#define SARADC_THRES1_HIGH_INT_ST_S  28
/** SARADC_THRES0_HIGH_INT_ST : RO; bitpos: [29]; default: 0;
 *  saradc thres0 high interrupt state
 */
#define SARADC_THRES0_HIGH_INT_ST    (BIT(29))
#define SARADC_THRES0_HIGH_INT_ST_M  (SARADC_THRES0_HIGH_INT_ST_V << SARADC_THRES0_HIGH_INT_ST_S)
#define SARADC_THRES0_HIGH_INT_ST_V  0x00000001U
#define SARADC_THRES0_HIGH_INT_ST_S  29
/** SARADC_APB_SARADC2_DONE_INT_ST : RO; bitpos: [30]; default: 0;
 *  saradc2 done interrupt state
 */
#define SARADC_APB_SARADC2_DONE_INT_ST    (BIT(30))
#define SARADC_APB_SARADC2_DONE_INT_ST_M  (SARADC_APB_SARADC2_DONE_INT_ST_V << SARADC_APB_SARADC2_DONE_INT_ST_S)
#define SARADC_APB_SARADC2_DONE_INT_ST_V  0x00000001U
#define SARADC_APB_SARADC2_DONE_INT_ST_S  30
/** SARADC_APB_SARADC1_DONE_INT_ST : RO; bitpos: [31]; default: 0;
 *  saradc1 done interrupt state
 */
#define SARADC_APB_SARADC1_DONE_INT_ST    (BIT(31))
#define SARADC_APB_SARADC1_DONE_INT_ST_M  (SARADC_APB_SARADC1_DONE_INT_ST_V << SARADC_APB_SARADC1_DONE_INT_ST_S)
#define SARADC_APB_SARADC1_DONE_INT_ST_V  0x00000001U
#define SARADC_APB_SARADC1_DONE_INT_ST_S  31

