espressif/esp-idf/components/soc/esp32c61/register/soc/apb_saradc_reg.h
/** SARADC_INT_CLR_REG register
 *  digital saradc int register
 */
#define SARADC_INT_CLR_REG (DR_REG_SARADC_BASE + 0x4c)
/** SARADC_TSENS_INT_CLR : WT; bitpos: [25]; default: 0;
 *  saradc tsens  interrupt clear
 */
#define SARADC_TSENS_INT_CLR    (BIT(25))
#define SARADC_TSENS_INT_CLR_M  (SARADC_TSENS_INT_CLR_V << SARADC_TSENS_INT_CLR_S)
#define SARADC_TSENS_INT_CLR_V  0x00000001U
#define SARADC_TSENS_INT_CLR_S  25
/** SARADC_THRES1_LOW_INT_CLR : WT; bitpos: [26]; default: 0;
 *  saradc thres1 low  interrupt clear
 */
#define SARADC_THRES1_LOW_INT_CLR    (BIT(26))
#define SARADC_THRES1_LOW_INT_CLR_M  (SARADC_THRES1_LOW_INT_CLR_V << SARADC_THRES1_LOW_INT_CLR_S)
#define SARADC_THRES1_LOW_INT_CLR_V  0x00000001U
#define SARADC_THRES1_LOW_INT_CLR_S  26
/** SARADC_THRES0_LOW_INT_CLR : WT; bitpos: [27]; default: 0;
 *  saradc thres0 low interrupt clear
 */
#define SARADC_THRES0_LOW_INT_CLR    (BIT(27))
#define SARADC_THRES0_LOW_INT_CLR_M  (SARADC_THRES0_LOW_INT_CLR_V << SARADC_THRES0_LOW_INT_CLR_S)
#define SARADC_THRES0_LOW_INT_CLR_V  0x00000001U
#define SARADC_THRES0_LOW_INT_CLR_S  27
/** SARADC_THRES1_HIGH_INT_CLR : WT; bitpos: [28]; default: 0;
 *  saradc thres1 high interrupt clear
 */
#define SARADC_THRES1_HIGH_INT_CLR    (BIT(28))
#define SARADC_THRES1_HIGH_INT_CLR_M  (SARADC_THRES1_HIGH_INT_CLR_V << SARADC_THRES1_HIGH_INT_CLR_S)
#define SARADC_THRES1_HIGH_INT_CLR_V  0x00000001U
#define SARADC_THRES1_HIGH_INT_CLR_S  28
/** SARADC_THRES0_HIGH_INT_CLR : WT; bitpos: [29]; default: 0;
 *  saradc thres0 high interrupt clear
 */
#define SARADC_THRES0_HIGH_INT_CLR    (BIT(29))
#define SARADC_THRES0_HIGH_INT_CLR_M  (SARADC_THRES0_HIGH_INT_CLR_V << SARADC_THRES0_HIGH_INT_CLR_S)
#define SARADC_THRES0_HIGH_INT_CLR_V  0x00000001U
#define SARADC_THRES0_HIGH_INT_CLR_S  29
/** SARADC_APB_SARADC2_DONE_INT_CLR : WT; bitpos: [30]; default: 0;
 *  saradc2 done interrupt clear
 */
#define SARADC_APB_SARADC2_DONE_INT_CLR    (BIT(30))
#define SARADC_APB_SARADC2_DONE_INT_CLR_M  (SARADC_APB_SARADC2_DONE_INT_CLR_V << SARADC_APB_SARADC2_DONE_INT_CLR_S)
#define SARADC_APB_SARADC2_DONE_INT_CLR_V  0x00000001U
#define SARADC_APB_SARADC2_DONE_INT_CLR_S  30
/** SARADC_APB_SARADC1_DONE_INT_CLR : WT; bitpos: [31]; default: 0;
 *  saradc1 done interrupt clear
 */
#define SARADC_APB_SARADC1_DONE_INT_CLR    (BIT(31))
#define SARADC_APB_SARADC1_DONE_INT_CLR_M  (SARADC_APB_SARADC1_DONE_INT_CLR_V << SARADC_APB_SARADC1_DONE_INT_CLR_S)
#define SARADC_APB_SARADC1_DONE_INT_CLR_V  0x00000001U
#define SARADC_APB_SARADC1_DONE_INT_CLR_S  31

/** SARADC_DMA_CONF_REG register
 *  digital saradc configure register
 */
#define SARADC_DMA_CONF_REG (DR_REG_SARADC_BASE + 0x50)
/** SARADC_APB_ADC_EOF_NUM : R/W; bitpos: [15:0]; default: 255;
 *  the dma_in_suc_eof gen when sample cnt = spi_eof_num
 */
#define SARADC_APB_ADC_EOF_NUM    0x0000FFFFU
#define SARADC_APB_ADC_EOF_NUM_M  (SARADC_APB_ADC_EOF_NUM_V << SARADC_APB_ADC_EOF_NUM_S)
#define SARADC_APB_ADC_EOF_NUM_V  0x0000FFFFU
#define SARADC_APB_ADC_EOF_NUM_S  0
/** SARADC_APB_ADC_RESET_FSM : R/W; bitpos: [30]; default: 0;
 *  reset_apb_adc_state
 */
#define SARADC_APB_ADC_RESET_FSM    (BIT(30))
#define SARADC_APB_ADC_RESET_FSM_M  (SARADC_APB_ADC_RESET_FSM_V << SARADC_APB_ADC_RESET_FSM_S)
#define SARADC_APB_ADC_RESET_FSM_V  0x00000001U
#define SARADC_APB_ADC_RESET_FSM_S  30
/** SARADC_APB_ADC_TRANS : R/W; bitpos: [31]; default: 0;
 *  enable apb_adc use spi_dma
 */
#define SARADC_APB_ADC_TRANS    (BIT(31))
#define SARADC_APB_ADC_TRANS_M  (SARADC_APB_ADC_TRANS_V << SARADC_APB_ADC_TRANS_S)
#define SARADC_APB_ADC_TRANS_V  0x00000001U
#define SARADC_APB_ADC_TRANS_S  31

/** SARADC_CLKM_CONF_REG register
 *  digital saradc configure register
 */
#define SARADC_CLKM_CONF_REG (DR_REG_SARADC_BASE + 0x54)
/** SARADC_CLKM_DIV_NUM : R/W; bitpos: [7:0]; default: 4;
 *  Integral I2S clock divider value
 */
#define SARADC_CLKM_DIV_NUM    0x000000FFU
#define SARADC_CLKM_DIV_NUM_M  (SARADC_CLKM_DIV_NUM_V << SARADC_CLKM_DIV_NUM_S)
#define SARADC_CLKM_DIV_NUM_V  0x000000FFU
#define SARADC_CLKM_DIV_NUM_S  0
/** SARADC_CLKM_DIV_B : R/W; bitpos: [13:8]; default: 0;
 *  Fractional clock divider numerator value
 */
#define SARADC_CLKM_DIV_B    0x0000003FU
#define SARADC_CLKM_DIV_B_M  (SARADC_CLKM_DIV_B_V << SARADC_CLKM_DIV_B_S)
#define SARADC_CLKM_DIV_B_V  0x0000003FU
#define SARADC_CLKM_DIV_B_S  8
/** SARADC_CLKM_DIV_A : R/W; bitpos: [19:14]; default: 0;
 *  Fractional clock divider denominator value
 */
#define SARADC_CLKM_DIV_A    0x0000003FU
#define SARADC_CLKM_DIV_A_M  (SARADC_CLKM_DIV_A_V << SARADC_CLKM_DIV_A_S)
#define SARADC_CLKM_DIV_A_V  0x0000003FU
#define SARADC_CLKM_DIV_A_S  14
/** SARADC_CLK_EN : R/W; bitpos: [20]; default: 0;
 *  reg clk en
 */
#define SARADC_CLK_EN    (BIT(20))
#define SARADC_CLK_EN_M  (SARADC_CLK_EN_V << SARADC_CLK_EN_S)
#define SARADC_CLK_EN_V  0x00000001U
#define SARADC_CLK_EN_S  20
/** SARADC_CLK_SEL : R/W; bitpos: [22:21]; default: 0;
 *  Set this bit to enable clk_apll
 */
#define SARADC_CLK_SEL    0x00000003U
#define SARADC_CLK_SEL_M  (SARADC_CLK_SEL_V << SARADC_CLK_SEL_S)
#define SARADC_CLK_SEL_V  0x00000003U
#define SARADC_CLK_SEL_S  21

/** SARADC_APB_TSENS_CTRL_REG register
 *  digital tsens configure register
 */
#define SARADC_APB_TSENS_CTRL_REG (DR_REG_SARADC_BASE + 0x58)
/** SARADC_TSENS_OUT : RO; bitpos: [7:0]; default: 128;
 *  temperature sensor data out
 */
#define SARADC_TSENS_OUT    0x000000FFU
#define SARADC_TSENS_OUT_M  (SARADC_TSENS_OUT_V << SARADC_TSENS_OUT_S)
#define SARADC_TSENS_OUT_V  0x000000FFU
#define SARADC_TSENS_OUT_S  0
/** SARADC_TSENS_IN_INV : R/W; bitpos: [13]; default: 0;
 *  invert temperature sensor data
 */
#define SARADC_TSENS_IN_INV    (BIT(13))
#define SARADC_TSENS_IN_INV_M  (SARADC_TSENS_IN_INV_V << SARADC_TSENS_IN_INV_S)
#define SARADC_TSENS_IN_INV_V  0x00000001U
#define SARADC_TSENS_IN_INV_S  13
/** SARADC_TSENS_CLK_DIV : R/W; bitpos: [21:14]; default: 6;
 *  temperature sensor clock divider
 */
#define SARADC_TSENS_CLK_DIV    0x000000FFU
#define SARADC_TSENS_CLK_DIV_M  (SARADC_TSENS_CLK_DIV_V << SARADC_TSENS_CLK_DIV_S)
#define SARADC_TSENS_CLK_DIV_V  0x000000FFU
#define SARADC_TSENS_CLK_DIV_S  14
/** SARADC_TSENS_PU : R/W; bitpos: [22]; default: 0;
 *  temperature sensor power up
 */
#define SARADC_TSENS_PU    (BIT(22))
#define SARADC_TSENS_PU_M  (SARADC_TSENS_PU_V << SARADC_TSENS_PU_S)
#define SARADC_TSENS_PU_V  0x00000001U
#define SARADC_TSENS_PU_S  22

/** SARADC_TSENS_CTRL2_REG register
 *  digital tsens configure register
 */
#define SARADC_TSENS_CTRL2_REG (DR_REG_SARADC_BASE + 0x5c)
/** SARADC_TSENS_XPD_WAIT : R/W; bitpos: [11:0]; default: 2;
 *  the time that power up tsens need wait
 */
#define SARADC_TSENS_XPD_WAIT    0x00000FFFU
#define SARADC_TSENS_XPD_WAIT_M  (SARADC_TSENS_XPD_WAIT_V << SARADC_TSENS_XPD_WAIT_S)
#define SARADC_TSENS_XPD_WAIT_V  0x00000FFFU
#define SARADC_TSENS_XPD_WAIT_S  0
/** SARADC_TSENS_XPD_FORCE : R/W; bitpos: [13:12]; default: 0;
 *  force power up tsens
 */
#define SARADC_TSENS_XPD_FORCE    0x00000003U
#define SARADC_TSENS_XPD_FORCE_M  (SARADC_TSENS_XPD_FORCE_V << SARADC_TSENS_XPD_FORCE_S)
#define SARADC_TSENS_XPD_FORCE_V  0x00000003U
#define SARADC_TSENS_XPD_FORCE_S  12
/** SARADC_TSENS_CLK_INV : R/W; bitpos: [14]; default: 1;
 *  inv tsens clk
 */
#define SARADC_TSENS_CLK_INV    (BIT(14))
#define SARADC_TSENS_CLK_INV_M  (SARADC_TSENS_CLK_INV_V << SARADC_TSENS_CLK_INV_S)
#define SARADC_TSENS_CLK_INV_V  0x00000001U
#define SARADC_TSENS_CLK_INV_S  14
/** SARADC_TSENS_CLK_SEL : R/W; bitpos: [15]; default: 0;
 *  tsens clk select
 */
#define SARADC_TSENS_CLK_SEL    (BIT(15))
#define SARADC_TSENS_CLK_SEL_M  (SARADC_TSENS_CLK_SEL_V << SARADC_TSENS_CLK_SEL_S)
#define SARADC_TSENS_CLK_SEL_V  0x00000001U
#define SARADC_TSENS_CLK_SEL_S  15

/** SARADC_CALI_REG register
 *  digital saradc configure register
 */
#define SARADC_CALI_REG (DR_REG_SARADC_BASE + 0x60)
/** SARADC_CALI_CFG : R/W; bitpos: [16:0]; default: 32768;
 *  saradc cali factor
 */
#define SARADC_CALI_CFG    0x0001FFFFU
#define SARADC_CALI_CFG_M  (SARADC_CALI_CFG_V << SARADC_CALI_CFG_S)
#define SARADC_CALI_CFG_V  0x0001FFFFU
#define SARADC_CALI_CFG_S  0

