espressif/esp-idf/components/soc/esp32c61/register/soc/apb_saradc_reg.h
/** APB_TSENS_WAKE_REG register
 *  digital tsens configure register
 */
#define APB_TSENS_WAKE_REG (DR_REG_SARADC_BASE + 0x64)
/** SARADC_WAKEUP_TH_LOW : R/W; bitpos: [7:0]; default: 0;
 *  reg_wakeup_th_low
 */
#define SARADC_WAKEUP_TH_LOW    0x000000FFU
#define SARADC_WAKEUP_TH_LOW_M  (SARADC_WAKEUP_TH_LOW_V << SARADC_WAKEUP_TH_LOW_S)
#define SARADC_WAKEUP_TH_LOW_V  0x000000FFU
#define SARADC_WAKEUP_TH_LOW_S  0
/** SARADC_WAKEUP_TH_HIGH : R/W; bitpos: [15:8]; default: 255;
 *  reg_wakeup_th_high
 */
#define SARADC_WAKEUP_TH_HIGH    0x000000FFU
#define SARADC_WAKEUP_TH_HIGH_M  (SARADC_WAKEUP_TH_HIGH_V << SARADC_WAKEUP_TH_HIGH_S)
#define SARADC_WAKEUP_TH_HIGH_V  0x000000FFU
#define SARADC_WAKEUP_TH_HIGH_S  8
/** SARADC_WAKEUP_OVER_UPPER_TH : RO; bitpos: [16]; default: 0;
 *  reg_wakeup_over_upper_th
 */
#define SARADC_WAKEUP_OVER_UPPER_TH    (BIT(16))
#define SARADC_WAKEUP_OVER_UPPER_TH_M  (SARADC_WAKEUP_OVER_UPPER_TH_V << SARADC_WAKEUP_OVER_UPPER_TH_S)
#define SARADC_WAKEUP_OVER_UPPER_TH_V  0x00000001U
#define SARADC_WAKEUP_OVER_UPPER_TH_S  16
/** SARADC_WAKEUP_MODE : R/W; bitpos: [17]; default: 0;
 *  reg_wakeup_mode
 */
#define SARADC_WAKEUP_MODE    (BIT(17))
#define SARADC_WAKEUP_MODE_M  (SARADC_WAKEUP_MODE_V << SARADC_WAKEUP_MODE_S)
#define SARADC_WAKEUP_MODE_V  0x00000001U
#define SARADC_WAKEUP_MODE_S  17
/** SARADC_WAKEUP_EN : R/W; bitpos: [18]; default: 0;
 *  reg_wakeup_en
 */
#define SARADC_WAKEUP_EN    (BIT(18))
#define SARADC_WAKEUP_EN_M  (SARADC_WAKEUP_EN_V << SARADC_WAKEUP_EN_S)
#define SARADC_WAKEUP_EN_V  0x00000001U
#define SARADC_WAKEUP_EN_S  18

/** APB_TSENS_SAMPLE_REG register
 *  digital tsens configure register
 */
#define APB_TSENS_SAMPLE_REG (DR_REG_SARADC_BASE + 0x68)
/** SARADC_TSENS_SAMPLE_RATE : R/W; bitpos: [15:0]; default: 20;
 *  HW sample rate
 */
#define SARADC_TSENS_SAMPLE_RATE    0x0000FFFFU
#define SARADC_TSENS_SAMPLE_RATE_M  (SARADC_TSENS_SAMPLE_RATE_V << SARADC_TSENS_SAMPLE_RATE_S)
#define SARADC_TSENS_SAMPLE_RATE_V  0x0000FFFFU
#define SARADC_TSENS_SAMPLE_RATE_S  0
/** SARADC_TSENS_SAMPLE_EN : R/W; bitpos: [16]; default: 0;
 *  HW sample en
 */
#define SARADC_TSENS_SAMPLE_EN    (BIT(16))
#define SARADC_TSENS_SAMPLE_EN_M  (SARADC_TSENS_SAMPLE_EN_V << SARADC_TSENS_SAMPLE_EN_S)
#define SARADC_TSENS_SAMPLE_EN_V  0x00000001U
#define SARADC_TSENS_SAMPLE_EN_S  16

/** SARADC_CTRL_DATE_REG register
 *  version
 */
#define SARADC_CTRL_DATE_REG (DR_REG_SARADC_BASE + 0x3fc)
/** SARADC_DATE : R/W; bitpos: [31:0]; default: 35676736;
 *  version
 */
#define SARADC_DATE    0xFFFFFFFFU
#define SARADC_DATE_M  (SARADC_DATE_V << SARADC_DATE_S)
#define SARADC_DATE_V  0xFFFFFFFFU
#define SARADC_DATE_S  0

#ifdef __cplusplus
}
#endif
